jankaluza/qsimkit/CPU/Variants/msp430x12x2.cpp
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef ADC10DTC1_
#define ADC10DTC1_ 0x0049
#endif
#ifndef TXBUF_0_
#define TXBUF_0_ 0x0077
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef URXSE
#define URXSE 0x08
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef MSC
#define MSC 0x0080
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef INCH_VCC2
#define INCH_VCC2 INCH_11
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef PENA
#define PENA 0x80
#endif
#ifndef __msp430x12x2
#define __msp430x12x2 
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef __msp430_headers_adc10_h
#define __msp430_headers_adc10_h 
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef CKPH
#define CKPH 0x80
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef REF2_5V
#define REF2_5V 0x0040
#endif
#ifndef CKPL
#define CKPL 0x40
#endif
#ifndef U0IE
#define U0IE IE2
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef URCTL_
#define URCTL_ 0x0072
#endif
#ifndef SREF_VREF_AVSS
#define SREF_VREF_AVSS SREF_1
#endif
#ifndef __MSP430_HAS_PORT3__
#define __MSP430_HAS_PORT3__ 
#endif
#ifndef ADC10CTL0_
#define ADC10CTL0_ 0x01B0
#endif
#ifndef ADC10CTL1_
#define ADC10CTL1_ 0x01B2
#endif
#ifndef ADC10SSEL_SMCLK
#define ADC10SSEL_SMCLK ADC10SSEL_3
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef __HAVE_BUILTIN_SETJMP__
#define __HAVE_BUILTIN_SETJMP__ 1
#endif
#ifndef U0ME
#define U0ME ME2
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef TXEPT
#define TXEPT 0x01
#endif
#ifndef USART0TX_VECTOR
#define USART0TX_VECTOR 12
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef USART0RX_VECTOR
#define USART0RX_VECTOR 14
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef ADC10AE0_
#define ADC10AE0_ 0x004A
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef ADC10SA_
#define ADC10SA_ 0x01BC
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef UTCTL0_
#define UTCTL0_ 0x0071
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
#ifndef UBR0_0_
#define UBR0_0_ 0x0074
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef SSEL_SMCLK
#define SSEL_SMCLK SSEL_2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef ADC10SHT_DIV16
#define ADC10SHT_DIV16 ADC10SHT_2
#endif
#ifndef INCH_A1
#define INCH_A1 INCH_1
#endif
#ifndef INCH_A2
#define INCH_A2 INCH_2
#endif
#ifndef INCH_A3
#define INCH_A3 INCH_3
#endif
#ifndef INCH_A4
#define INCH_A4 INCH_4
#endif
#ifndef INCH_A5
#define INCH_A5 INCH_5
#endif
#ifndef INCH_A6
#define INCH_A6 INCH_6
#endif
#ifndef INCH_A7
#define INCH_A7 INCH_7
#endif
#ifndef ADC10IFG
#define ADC10IFG 0x0004
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef ADC10SHT_DIV64
#define ADC10SHT_DIV64 ADC10SHT_3
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef REFON
#define REFON 0x0020
#endif
#ifndef ADC10AE
#define ADC10AE ADC10AE0
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef ADC10B1
#define ADC10B1 0x0002
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef CHAR
#define CHAR 0x10
#endif
#ifndef ADC10CT
#define ADC10CT 0x0004
#endif
#ifndef SPB
#define SPB 0x20
#endif
#ifndef SREF_VEREF_VEREF
#define SREF_VEREF_VEREF SREF_6
#endif
#ifndef ADC10DF
#define ADC10DF 0x0200
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef SREF_VREF_VEREF
#define SREF_VREF_VEREF SREF_5
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef RXERR
#define RXERR 0x01
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef STC
#define STC 0x02
#endif
#ifndef ADC10IE
#define ADC10IE 0x0008
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef U0TXBUF_
#define U0TXBUF_ 0x0077
#endif
#ifndef UTCTL_0_
#define UTCTL_0_ 0x0071
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 16
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef DCOR
#define DCOR 0x01
#endif
#ifndef ADC10ON
#define ADC10ON 0x0010
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef URCTL_0_
#define URCTL_0_ 0x0072
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef RXBUF_
#define RXBUF_ 0x0076
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef U0IFG
#define U0IFG IFG2
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef ADC10SC
#define ADC10SC 0x0001
#endif
#ifndef ADC10SR
#define ADC10SR 0x0400
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef ADC10TB
#define ADC10TB 0x0008
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef __MSP430_HAS_FLASH__
#define __MSP430_HAS_FLASH__ 
#endif
#ifndef ADC10FETCH
#define ADC10FETCH 0x0001
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef RXWAKE
#define RXWAKE 0x02
#endif
#ifndef U0RCTL_
#define U0RCTL_ 0x0072
#endif
#ifndef ADC10DISABLE
#define ADC10DISABLE 0x0000
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef UMCTL_0_
#define UMCTL_0_ 0x0073
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef INCH_VEREF_PLUS
#define INCH_VEREF_PLUS INCH_8
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef SREF_VEREF_AVSS
#define SREF_VEREF_AVSS SREF_2
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef __MSP430_HAS_PORT2__
#define __MSP430_HAS_PORT2__ 
#endif
#ifndef UART0TX_VECTOR
#define UART0TX_VECTOR USART0TX_VECTOR
#endif
#ifndef ADC10SSEL_ADC10OSC
#define ADC10SSEL_ADC10OSC ADC10SSEL_0
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef TXBUF0_
#define TXBUF0_ 0x0077
#endif
#ifndef ADC10SSEL_MCLK
#define ADC10SSEL_MCLK ADC10SSEL_2
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef UART0RX_VECTOR
#define UART0RX_VECTOR USART0RX_VECTOR
#endif
#ifndef SSEL0
#define SSEL0 0x10
#endif
#ifndef SSEL1
#define SSEL1 0x20
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef REFBURST
#define REFBURST 0x0100
#endif
#ifndef PEV
#define PEV 0x40
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef RXBUF0_
#define RXBUF0_ 0x0076
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __GNUC__
#define __GNUC__ 3
#endif
#ifndef SWRST
#define SWRST 0x01
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef __MSP430_HAS_BASIC_CLOCK__
#define __MSP430_HAS_BASIC_CLOCK__ 
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 6
#endif
#ifndef ENC
#define ENC 0x0002
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef ADC10SHT_DIV4
#define ADC10SHT_DIV4 ADC10SHT_0
#endif
#ifndef __msp430_have_port1
#define __msp430_have_port1 
#endif
#ifndef __msp430_have_port2
#define __msp430_have_port2 
#endif
#ifndef __msp430_have_port3
#define __msp430_have_port3 
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef __MSP430_HAS_UART0__
#define __MSP430_HAS_UART0__ 
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef FE
#define FE 0x80
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef SSEL_UCLKI
#define SSEL_UCLKI SSEL_0
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef URXWIE
#define URXWIE 0x04
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef MSP430_NO_HW_MUL
#define MSP430_NO_HW_MUL 1
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef MM
#define MM 0x02
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef UBR10_
#define UBR10_ 0x0075
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef OE
#define OE 0x20
#endif
#ifndef INCH_VEREF_MINUS
#define INCH_VEREF_MINUS INCH_9
#endif
#ifndef SSEL_0
#define SSEL_0 0x00
#endif
#ifndef SSEL_1
#define SSEL_1 0x10
#endif
#ifndef SSEL_2
#define SSEL_2 0x20
#endif
#ifndef SSEL_3
#define SSEL_3 0x30
#endif
#ifndef PE
#define PE 0x40
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef RXBUF_0_
#define RXBUF_0_ 0x0076
#endif
#ifndef ISSH
#define ISSH 0x0100
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef XT5V
#define XT5V 0x08
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef INCH_TEMP
#define INCH_TEMP INCH_10
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef __MSP430_HAS_ADC10__
#define __MSP430_HAS_ADC10__ 
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef SREF_AVCC_AVSS
#define SREF_AVCC_AVSS SREF_0
#endif
#ifndef ADC10_VECTOR
#define ADC10_VECTOR 10
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 102
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef ADC10AE_
#define ADC10AE_ ADC10AE0_
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef ADC10SHT_DIV8
#define ADC10SHT_DIV8 ADC10SHT_1
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 2
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef REFOUT
#define REFOUT 0x0200
#endif
#ifndef ADC10DTC0_
#define ADC10DTC0_ 0x0048
#endif
#ifndef SREF_AVCC_VEREF
#define SREF_AVCC_VEREF SREF_4
#endif
#ifndef ME2_
#define ME2_ 0x0005
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ int
#endif
#ifndef UBR1_0_
#define UBR1_0_ 0x0075
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef ADC10BUSY
#define ADC10BUSY 0x0001
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef __msp430_headers_usart_h
#define __msp430_headers_usart_h 
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 18
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef ADC10MEM_
#define ADC10MEM_ 0x01B4
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 4
#endif
#ifndef ADC10SSEL_ACLK
#define ADC10SSEL_ACLK ADC10SSEL_1
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef INCH_A0
#define INCH_A0 INCH_0
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef __VERSION__
#define __VERSION__ "3.2.3"
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x12x2 : public Variant {
	public:
		Variant_msp430x12x2() {}
		virtual ~Variant_msp430x12x2() {}

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


